Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.LocationByModelOrigin Field
 A constant string defining that the view location is calculated by model origin.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string LocationByModelOrigin = "ModelOrigin"
Public Const LocationByModelOrigin As String = "ModelOrigin"
Field Value
Type: String
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace